Revit 2026 API

# ImageInstanceCanHaveSnaps Property

---

When true the ImageInstance has snaps that can be enabled with the EnableSnaps property

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanHaveSnaps { get; }
```
```vb
Public ReadOnly Property CanHaveSnaps As Boolean
	Get
```
```cpp
public:
property bool CanHaveSnaps {
	bool get ();
}
```
```fsharp
member CanHaveSnaps : bool with get
```

#### Property Value

Boolean

Snaps are only available for images based on PDF files that are vector based.

#### Reference

ImageInstance Class

Autodesk.Revit.DB Namespace